In [2]:
import pandas as pd

In [3]:
classes = pd.read_csv('class_registration.csv')
classes.drop(['register_time', 'is_paid', 'external_id'], axis=1, inplace=True)

In [4]:
classes.head()

   id  class_id  student_id
0  15         3          15
1  16         3          16
2  17         3          17
3  18         3          18
4  19         3          19

In [5]:
students = pd.read_csv('student.csv')
students.drop(['family_id','cn_name','email','relation', 'birthday', 'external_id'], axis=1, inplace=True)

In [6]:
students.head()

   id      en_name
0  15     Zhen Cai
1  16  Louisa Chen
2  17       Joy He
3  18      Lei Hou
4  19    Sally LIU

In [7]:
studentclasses = classes.join(students.set_index('id'), on='student_id')

In [8]:
studentclasses.head()

   id  class_id  student_id      en_name
0  15         3          15     Zhen Cai
1  16         3          16  Louisa Chen
2  17         3          17       Joy He
3  18         3          18      Lei Hou
4  19         3          19    Sally LIU

In [9]:
df = studentclasses.groupby('en_name')['en_name'].count()

In [10]:
df

en_name
ANDREW LI      2
Aaron Wu       2
Albert Shi     2
Alex Quan      2
Alice Chang    1
              ..
Zhiyi Wang     2
Zou Liwei      1
doris wei      1
haoyuan yin    1
shu zhang      1
Name: en_name, Length: 86, dtype: int64

In [13]:
df.to_csv('output.csv')

In [16]:
pd.read_csv('output.csv')

        en_name  en_name.1
0     ANDREW LI          2
1      Aaron Wu          2
2    Albert Shi          2
3     Alex Quan          2
4   Alice Chang          1
..          ...        ...
81   Zhiyi Wang          2
82    Zou Liwei          1
83    doris wei          1
84  haoyuan yin          1
85    shu zhang          1

[86 rows x 2 columns]